#+TITLE: ~SELECT "view"(anyelement, projection)~
#+OPTIONS: ^:{}

A projection is the JSON equivalent to ~SELECT <projection> FROM ...~
in SQL. So, while SQL has ~CREATE VIEW~, we have a ~view~ function which can be specialized

Projections, may either specify a list of fields to return or list
fields to exclude in the result documents.

*IMPORTANT* Except for excluding the ~_id~ and ~_type~ field in
inclusive projections, you cannot mix exclusive and inclusive
projections.

| Syntax                              | Description                           |
|-------------------------------------+---------------------------------------|
| <field>: <1 or true>                | Specify the inclusion of a field.     |
| <field>: <0 or false>               | Specify the suppression of the field. |


** Example

#+HEADER: :results value html
#+BEGIN_SRC sql :engine postgresql :cmdline "--html --host localhost --user pongo pongo"
  SELECT * FROM "DTRT_with__id_and__type_for_inclusive"(NULL);
  SELECT * FROM "DTRT_with__id_and__type_for_inclusive"('{"_type" : 0}'::json);
  SELECT * FROM "DTRT_with__id_and__type_for_inclusive"('{"_id" : 1}'::json);

  SELECT * FROM "DTRT_with__id_and__type_for_inclusive"('{"_id" : false}'::json);
#+END_SRC

#+RESULTS:
#+BEGIN_HTML
<table border="1">
  <tr>
    <th align="center">DTRT_with__id_and__type_for_inclusive</th>
  </tr>
  <tr valign="top">
    <td align="left">{ &quot;_id&quot; : true, &quot;_type&quot; : true }</td>
  </tr>
</table>

<table border="1">
  <tr>
    <th align="center">DTRT_with__id_and__type_for_inclusive</th>
  </tr>
  <tr valign="top">
    <td align="left">{ &quot;_id&quot; : true, &quot;_type&quot; : 0 }</td>
  </tr>
</table>

<table border="1">
  <tr>
    <th align="center">DTRT_with__id_and__type_for_inclusive</th>
  </tr>
  <tr valign="top">
    <td align="left">{ &quot;_type&quot; : true, &quot;_id&quot; : 1 }</td>
  </tr>
</table>

<table border="1">
  <tr>
    <th align="center">DTRT_with__id_and__type_for_inclusive</th>
  </tr>
  <tr valign="top">
    <td align="left">{ &quot;_type&quot; : true, &quot;_id&quot; : false }</td>
  </tr>
</table>

#+END_HTML



